// GameDev.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using namespace std;

//const int size_1 = 5;
//const int size_2 = 11;

void show(int size_1, int size_2, char Array[5][11]) {
	for (int i = 0; i < size_1; i++) {
		for (int j = 0; j < size_2; j++) {
			cout << Array[i][j] << ends;
		}
		cout << endl;
	}
}
//int MoveToObject()

int main()
{
	//FileSystem

















































	/*char Array[size_1][size_2]{
	{'o','o','o','o','o','o','o','o','o','o','o'},
	{'o','@','o','o','o','o','o','o','o','*','o'},
	{'o','o','@','o','o','1','o','o','*','o','o'},
	{'o','@','o','o','o','o','o','o','o','*','o'},
	{'o','o','o','o','o','o','o','o','o','o','o'},
	};

	show(5, 11, Array);*/
}



































// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
